# Εισαγωγή βιβλιοθήκης κανονικών εκφράσεων
# για την εκτέλεση παραδειγμάτων αντιστοίχισης
# pattern matching με την χρήση regular εκφράσεων
import re
# Λίστα απο πρότυπα εκφράσεων και των αντίστοιχων απαντήσεων
patterns_responses = [
    (r"Γειά σας", "Γειά σας! Πώς μπορώ να σας βοηθήσω;"),
    (r"Πώς λειτουργείτε;", "Είμαι ένα απλό chatbot που χρησιμοποιεί κανονικές εκφράσεις."),
    (r"Τι μπορείτε να κάνετε;", "Μπορώ να απαντήσω σε ερωτήσεις και να κάνω μικρή συνομιλία."),
    (r"Σπουδάζω στο Πανεπιστήμιο Μακεδονίας", "Τέλεια, Πολύ καλή επιλογή."),
    (r"Ποιές κατευθύνσεις υπάρχουν;", "1. Επιστήμη & Τεχνολογία Υπολογιστών 2.Πληροφοριακά Συστήματα"),
    (r"Πόσα μαθήματα απαιτούνται για την λήψη πτυχίου;", "Στην Εφαρμοσμένη Πληροφορική απαιτούνται 49 μαθήματα"),
    (r"Αντίο", "Αντίο! Αν χρειαστείτε περισσότερη βοήθεια, εδώ είμαι.")
]
# Η παρακάτω συνάρτηση είναι υπεύθυνη για τον έλεγχο των προτάσεων του χρήστη
def chatbot_response(user_input):
    for pattern, response in patterns_responses:
        # Χρησιμοποιούμε τη re.match για να ανιχνεύσουμε αν η πρόταση του χρήστη ταιριάζει με το πρότυπο.
        match = re.match(pattern, user_input, re.IGNORECASE)
        if match:
            return re.sub(pattern, response, user_input)

    return "Λυπάμαι, δεν μπορώ να βρω καμία αντίστοιχη απάντηση."
# Αυτή η επανάληψη επιτρέπει στον χρήστη να επικοινωνεί με το chatbot.
while True:
    user_input = input("You: ")
    if user_input.lower() == 'exit':
        print("Αντίο!")
        break
    response = chatbot_response(user_input)
    print("Chatbot: " + response)
